SoCXin/AT32F413/src/NET/NET_MAC/NET_MAC.C
/********************************** (C) COPYRIGHT ******************************
* File Name          : CH561.C
* Author             : WCH
* Version            : V1.0
* Date               : 2017/3/8
* Description        : CH561网络部分初始化及MAC收发接口函数
*******************************************************************************/



/******************************************************************************/
/* 文件包含 */
#include <stdio.h>
#include <string.h>
#include "CH561SFR.H"
#include "SYSFREQ.H"
#include "NETSFR.H"
#include "NETMAC.H"

/******************************************************************************/
/* 全局变量定义 */
ETHERHEAD    ETH;                                                               /* mac层包头 */
ARPPACKAGE   ARP;                                                               /* arp数据包 */
MACCtrl      mac_cotrl;                                                         /* CH561MAC控制结构 */
struct  _RXBUFST    RxCtrl;                                                     /* RX接收控制信息表 */
struct  _TXBUFST    TxCtrl;                                                     /* TX接收控制信息表 */
UINT8V  SendSuc;                                                                /* 发送数据包 成功标志 */
UINT8V  PHYStatus;                                                              /* PHY状态 */

/*******************************************************************************
* Function Name  : PHY_ReadData
* Description    : 从PHY读取数据，数据宽度为16位
* Input          : regad PHY寄存器地址 
* Output         : None
* Return         : None
*******************************************************************************/
UINT16 PHY_ReadData(UINT16 regad)
{
    R32_ETHE_PHYCR = RB_PHYAD(FTPHY_RB_PHYAD) | RB_REGAD(regad) | RB_MIIRD;     /* 向PHY控制寄存器写入PHY地址，PHY寄存器地址，以及发送读信号*/
    Delay_us(100);
    while( R32_ETHE_PHYCR & RB_MIIRD );                                         /* 等待读完成 */
    return( (UINT16)(R32_ETHE_PHYCR & RB_MIIRDATA) );
}

/*******************************************************************************
* Function Name  : CH561PHY_Process
* Description    : PHY处理函数，根据协商结果，来配置MACCR寄存器
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void CH561PHY_Process(void)
{
    UINT16 value;

    value = PHY_ReadData(FTPHY_REG_STATUS);
    if( (value&RB_LINK_STATUS)==0 ){
    }
    if( (value&RB_AUTO_NEG_CMP)==0 ){
    }
    value = PHY_ReadData(FTPHY_REG_CONTROL);
    if((value & RB_DUPLEX_MODE) > 0){
        R32_ETHE_MACCR |= RB_FULLDUP;
    }
    else{
        R32_ETHE_MACCR &= ~(RB_FULLDUP);
    }
    if((value & RB_SPEED_SEL) > 0){
        R32_ETHE_MACCR |= RB_SPEED_100;
    }
    else{
        R32_ETHE_MACCR &= ~(RB_SPEED_100);
    }
}

/*******************************************************************************
* Function Name  : CH561MAC_ParamInit
* Description    : 参数初始化函数，初始化全局变量
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void CH561MAC_ParamInit(void)
{
    memset((void *)&TxCtrl,0,sizeof(TxCtrl));
    memset((void *)&RxCtrl,0,sizeof(RxCtrl));
    RxCtrl.RxDMAEnable = TRUE;
}

/*******************************************************************************
* Function Name  : MAC_InitTXDes
* Description    : 初始化发送描述，发送描述符必须16字节对齐
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void MAC_InitTXDes(void)
{

    UINT32 i;
    mac_txdes *tmp;

    mac_cotrl.txdes_top = (mac_txdes *)TxDesBuf;                                /* 将描述符顶部指向描述符缓冲区头部 */
    mac_cotrl.txdes_cur = mac_cotrl.txdes_top;                                  /* 当前描述符指向描述符缓冲区头部*/
    mac_cotrl.txdes_end = mac_cotrl.txdes_top + (TX_QUEUE_NUM - 1);             /* 最后一个描述符指向缓冲区尾部*/
    memset(mac_cotrl.txdes_top, 0,sizeof(TxDesBuf));                            /* 清空发送描述符 */
    mac_cotrl.txdes_end->txdes1 |= TXDES1_EDOTR;                                /* 最后一个描述符置为结束标志 */
    mac_cotrl.txdes_cur->txdes2 |= (UINT32)MACTxBuf[TxCtrl.SendIndex];          /* 发送缓冲区的基地址 */
    MACSendbuf = (UINT8 *)&MACTxBuf[TxCtrl.SendIndex][14];
    tmp = mac_cotrl.txdes_top;
    for(i = 0; i < TX_QUEUE_NUM; i++){                                          /* 将所有描述符用链表连接 */
        tmp->txdes3 = (UINT32)(tmp + 1);
        tmp = (mac_txdes *)tmp->txdes3;
    }
    mac_cotrl.txdes_end->txdes3 = (UINT32)mac_cotrl.txdes_top;
}

/*******************************************************************************
* Function Name  : MAC_InitRXDes
* Description    : 初始化接收描述，接收描述符必须16字节对齐
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void MAC_InitRXDes(void)
{
    int i;
    mac_rxdes *tmp;

    mac_cotrl.rxdes_top = (void *)RxDesBuf;                                     /* rxdes_top指向第一个描述符 */
    mac_cotrl.rxdes_cur = mac_cotrl.rxdes_top;                                  /* rxdes_cur指向第一个描述符 */
    mac_cotrl.rxdes_end = mac_cotrl.rxdes_top + (RX_QUEUE_NUM - 1);             /* rxdes_end指向最后一个描述符 */
    memset(mac_cotrl.rxdes_top, 0, sizeof(RxDesBuf));                           /* 缓冲区清空*/
    mac_cotrl.rxdes_end->rxdes1 |= RXDES1_EDORR;                                /* 最后一个描述符置为结束标志 */    
    mac_cotrl.rxdes_cur->rxdes2 |= (UINT32)MACRxBuf[RxCtrl.RecvIndex];          /* 接收缓冲区的基地址 */
    tmp = mac_cotrl.rxdes_top;                                                  /* 指向第一个描述符 */
    tmp->rxdes0 |= RXDES0_RXDMA_OWN;                                            /* 置MAC拥有本描述符使用权限 */
    for(i = 0; i < RX_QUEUE_NUM; i++){                                          /* 将所有描述符用链表连接 */
        tmp->rxdes1 |= RXDES1_RXBUF_SIZE( RX_BUF_SIZE );                        /* 接收缓冲区大小，单位为字节 */
        tmp->rxdes3 = (UINT32)(tmp + 1);                                        /* rxdes3保存下一个描述符地址 */
        tmp = (mac_rxdes *)tmp->rxdes3;                                         /* 指向下一个描述符地址 */ 
    }
    mac_cotrl.rxdes_end->rxdes3 = (UINT32)mac_cotrl.rxdes_top;                  /* rxdes3保存下一个描述符地址（首个描述符）*/
}

