SoCXin/AT32F413/src/NET/NET_MAC/NET_MAC.C
/*******************************************************************************
* Function Name  : CH561MAC_Open
* Description    : CH561MAC打开函数，本函数使用默认配置
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void CH561MAC_Open(void)
{

    UINT32 i;

    i = R32_ETHE_ISR;                                                           /* 清除中断 */
    R32_ETHE_MACCR = RB_SW_RST;                                                 /* 复位MAC */ 
    MAC_InitRXDes( );                                                           /* 初始化接收描述符 */
    MAC_InitTXDes( );                                                           /* 初始化发送描述符 */

#ifdef  TX_QUEUE_NUM
    R32_ETHE_TXR_BADR = (UINT32)mac_cotrl.txdes_top;                            /* 将发送描述符地址写入R32_ETHE_TXR_BADR */
#else
    R32_ETHE_TXR_BADR = (UINT32)mac_cotrl.txdes_point;                          /* 将发送描述符地址写入R32_ETHE_TXR_BADR */
#endif

    R32_ETHE_RXR_BADR = (UINT32)mac_cotrl.rxdes_top;                            /* 将接收描述符地址写入R32_ETHE_RXR_BADR */
    R32_ETHE_IMR = RB_RPKT_FINISH_EN | RB_NORXBUF_EN | RB_XPKT_OK_EN |          /* 设置MAC中断使能寄存器 */
                   RB_XPKT_LOST_EN | RB_RPKT_LOST_EN | RB_PHYSTS_CHG_EN;
    i = (UINT32)(CH561MACAddr[2]<<24) + (UINT32)(CH561MACAddr[3]<<16) + (UINT32)(CH561MACAddr[4]<<8) + CH561MACAddr[5]; 
    R32_ETHE_MAC_LADR = i;                                                      /* 写MAC地址寄存器的低4节*/
    i = (UINT32)(CH561MACAddr[0]<<8) + CH561MACAddr[1]; 
    R32_ETHE_MAC_MADR = i & 0xffff;                                             /* 写MAC地址寄存器的高2节*/

    R32_ETHE_ITC   = RB_TXINT_THR(1);                                           /* 设置中断定时器 */
     R32_ETHE_APTC  = RB_RXINT_CNT(1);                                          /* 设置查询寄存器 */
    R32_ETHE_DBLAC = RB_RXFIFO_LTHR(2) | RB_RXFIFO_HTHR(6) | RB_RX_THR_EN |     /* 设置DMA突发长度 */
                     RB_INCR_SEL(2);
#if 1
    R32_ETHE_MACCR |= ( RB_RCV_ALL | RB_TDMA_EN | RB_RDMA_EN | RB_CRC_APD | 
                      RB_XMT_EN | RB_RCV_EN );                                  /* 设置MACCR寄存器 */
#else
    R32_ETHE_MACCR |= ( RB_TDMA_EN | RB_RDMA_EN | RB_CRC_APD | 
                      RB_XMT_EN | RB_RCV_EN );                                  /* 设置MACCR寄存器 */
#endif  
}

/*******************************************************************************
* Function Name  : CH561NET_Init
* Description    : 初始化CH56以太网部分
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void CH561NET_Init(void)
{
    R8_INT_EN_IRQ_GLOB &= ~RB_IE_IRQ_GLOB;                                      /* 必须关全局中断 */

    R32_PA_DIR |= (1<<18);                                                      /*PA18为LINK和ACK灯 */
    R8_MISC_CTRL_ETH |= RB_MISC_ETH_RST | RB_MISC_ETH_LED;

    R8_SAFE_ACCESS_SIG = 0x57;                                                  /* unlock step 1 */
    R8_SAFE_ACCESS_SIG = 0xA8;                                                  /* unlock step 2 */                   
    R8_SLP_WAKE_CTRL  &= 0x7f;                                                  /* 开启电源 */
    R8_SAFE_ACCESS_SIG = 0x00;                                                  /* 写保护 */

    Delay_ms( 50 );
    R8_MISC_CTRL_ETH &= ~RB_MISC_ETH_RST;                                       /* 复位结束*/
    Delay_ms( 200 );

    R8_SAFE_ACCESS_SIG = 0x57 ;                                                 /* unlock step 1 */
    R8_SAFE_ACCESS_SIG = 0xA8 ;                                                 /* unlock step 2 */
    R8_SLP_CLK_OFF1 &= ~RB_SLP_CLK_ETH;                                         /* 打开时钟 */
    R8_SAFE_ACCESS_SIG = 0;                                                     /* 写保护 */
}

/*******************************************************************************
* Function Name  : NET_INIT
* Description    : 以太网初始化
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void NET_INIT( void )
{
    CH561MAC_ParamInit( );                                                      /* 变量初始化 */
    CH561NET_Init( );                                                           /* 开启以太网部分电源，时钟，elink灯 */
    CH561MAC_Open( );                                                           /* 初始化MAC */
    CH561PHY_Process( );                                                        /* 初始化PHY */
}

/*******************************************************************************
* Function Name  : MAC_RxSuccessHandle
* Description    : 以太网接收成功回调函数，主要是处理缓冲区标识，查询到当前缓冲区
                   没有空闲，则停止DMA接收直到缓冲区可用才开启。
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void MAC_RxSuccessHandle(void)
{
    RxCtrl.RxBufStau[RxCtrl.RecvIndex] = BUF_IP_LOCK;                           /* 将此缓冲区锁定，权限交给上层 */
    RxCtrl.RxBufAddr[RxCtrl.RecvIndex]=((UINT32)MACRxBuf[RxCtrl.RecvIndex])+2;  /* 地址向后偏移2字节，每个报文前2个字节无效 */
    RxCtrl.RecvIndex++;                                                         /* MAC接收索引指向下一个接收缓冲区 */
    if(RxCtrl.RecvIndex >= RX_QUEUE_NUM){                                       /* 检查是否到尾部 */
        RxCtrl.RecvIndex = 0;
    }
    /* 处理接收缓冲区溢出的方法是丢失最早的数据包 */
    if(RxCtrl.RxBufStau[RxCtrl.RecvIndex] == BUF_IDLE){                         /* 如果下一个接收缓冲区空闲，则将接收描述符指向此缓冲区 */
        RxCtrl.RemainCout++;
        if(RxCtrl.RemainCout > RX_QUEUE_NUM){
            RxCtrl.RemainCout = RX_QUEUE_NUM;
        }
    }
    else{
    }
    RxCtrl.RxBufStau[RxCtrl.RecvIndex] = BUF_MAC_LOCK;                          /* 此缓冲区由MAC使用，MAC进行锁定 */
    mac_cotrl.rxdes_cur = (mac_rxdes *)mac_cotrl.rxdes_cur->rxdes3;             /* 将当前描述符指向下一个 */
    /* 初始化下一个描述符 */
    mac_cotrl.rxdes_cur->rxdes2 = (UINT32)MACRxBuf[RxCtrl.RecvIndex];    
    mac_cotrl.rxdes_cur->rxdes0 = RXDES0_RXDMA_OWN;
    RxCtrl.RxDMAEnable = TRUE;
}

