SoCXin/AT32F413/src/NET/NET_MAC/NET_MAC.C
/*******************************************************************************
* Function Name  : MAC_QueryInput
* Description    : 查询是否有可读数据包
* Input          : None
* Output         : None
* Return         : 返回剩余数据包个数，0表示没有数据
*******************************************************************************/
UINT8 MAC_QueryInput(void)
{
    return RxCtrl.RemainCout;                                                   /* 返回剩余包数据数目 */
}

/*******************************************************************************
* Function Name  : MAC_Xmit
* Description    : MAC发送函数，只能发送一包数据
* Input          : tx_addr  发送缓冲区地址
*                ：size     发送数据长度
* Output         : None
* Return         : None
*******************************************************************************/
void MAC_Xmit( UINT32 size)
{
    TxCtrl.TxBufStat[TxCtrl.SendIndex] = BUF_MAC_LOCK;                         /* 修改发送信息列表 */
    if( mac_cotrl.txdes_cur->txdes0 & TXDES0_TXDMA_OWN ){
//        R32_ETHE_MACCR &= (~RB_TDMA_EN);
//        R32_ETHE_MACCR |= RB_TDMA_EN; 
    }
    mac_cotrl.txdes_cur->txdes1 &= TXDES1_EDOTR;
    mac_cotrl.txdes_cur->txdes1 |= ( TXDES1_TXBUF_SIZE(size) | TXDES1_LTS | 
                                   TXDES1_FTS | TXDES1_TXIC );
    mac_cotrl.txdes_cur->txdes0 = TXDES0_TXDMA_OWN;
    SendSuc = 1;
    TxCtrl.SendIndex++;
    if(TxCtrl.SendIndex >= TX_QUEUE_NUM){
        TxCtrl.SendIndex = 0;
    }
    if( (R32_ETHE_APTC & RB_TXINT_CNT(0xf)) == 0 ){
        R32_ETHE_TXPD = 0xffffffff;                                             /* 写任意数操作来触发MAC读发送描述符 */
    }
}

/*******************************************************************************
* Function Name  : MAC_SendOkHanld
* Description    : 由CH561MAC_Isr调用，CH561MAC发送完成中断
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void MAC_SendOkHanld(void)
{                                                                                    
    R8_INT_EN_IRQ_GLOB &= ~RB_IE_IRQ_GLOB;                                      /* 关闭IRQ全局中断 */
    mac_cotrl.txdes_cur = (mac_txdes *)mac_cotrl.txdes_cur->txdes3;             /* 将发送描述符指向下一个 */
    mac_cotrl.txdes_cur->txdes2 |= (UINT32)MACTxBuf[TxCtrl.SendIndex];          /* 发送缓冲区的基地址 */
    MACSendbuf = (UINT8 *)&MACTxBuf[TxCtrl.SendIndex][14];
    SendSuc = 0;                                                                /* 发送成功标志清0 */
    R8_INT_EN_IRQ_GLOB |= RB_IE_IRQ_GLOB;                                       /* 开启IRQ全局中断 */
}

/*******************************************************************************
* Function Name  : PHY_GetLinkStatus
* Description    : 获取PHY的连接状态，在PHY改变中断中调用，获取当前状态
* Input          : None
* Output         : None
* Return         : 返回连接状态
*******************************************************************************/
UINT8 PHY_GetLinkStatus(void)
{
    UINT8  status;
    UINT16 value;

    value = PHY_ReadData(FTPHY_REG_STATUS);                                     /* 读取状态寄存器 */
    if( (value & RB_LINK_STATUS) == 0 ){                                        /* 如果为断开状态 */
        status =  PHY_DISCONN;  
    }
    else{
        value = PHY_ReadData(FTPHY_REG_CONTROL);                                /* 读取PHY控制寄存器 */
        if((value & RB_DUPLEX_MODE) ){                                          /* 如果为全双工模式 */
            R32_ETHE_MACCR |= RB_FULLDUP;
            if((value & RB_SPEED_SEL) > 0){                                     /* 获取速度 */
                R32_ETHE_MACCR |= RB_SPEED_100;
                status = PHY_100M_FLL;                                          /* 全双工，100M */
            }
            else{ 
                R32_ETHE_MACCR &= ~RB_SPEED_100;
                status = PHY_10M_FLL;                                           /* 全双工，10M */
            }
        }
        else{                                                                   /* 如果为半双工模式 */
            R32_ETHE_MACCR &= ~(RB_FULLDUP);                                    /* 获取速度 */
            if((value & RB_SPEED_SEL) > 0){                                    
                R32_ETHE_MACCR |= RB_SPEED_100;
                status = PHY_100M_HALF;                                         /* 半双工，100M */
            }
            else{ 
                R32_ETHE_MACCR &= ~(RB_SPEED_100);
                status = PHY_10M_HALF;                                          /* 半双工，10M */
            }
        }
    }                   
    return status;
}

/*******************************************************************************
* Function Name  : MAC_RecvFinishHanld
* Description    : 由CH561MAC_Isr调用，接收完毕中断处理函数
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void MAC_RecvFinishHanld(void)
{

    if(mac_cotrl.rxdes_cur->rxdes0 & RXDES0_FRS){                               /* 是否是否为第一个描述符 */
        if(mac_cotrl.rxdes_cur->rxdes0 & RXDES0_RX_ODD_NB){                     /* 半字节错误 */
#if  CH561_DEBUG
            printf("ERROR *** RX_ODD_NB\n");
#endif 
            return;
        }
        if(mac_cotrl.rxdes_cur->rxdes0 & RXDES0_CRC_ERR){                       /* CRC校验错误 */
#if  CH561_DEBUG
            printf("ERROR *** CRC\n");
#endif
            return;
        }
        if(mac_cotrl.rxdes_cur->rxdes0 & RXDES0_RX_ERR){                        /* 接收描述符DES0错误 */
#if  CH561_DEBUG
            printf("ERROR *** RX_ERR\n");
#endif
            return;
        }
        RxCtrl.RxBufLen[RxCtrl.RecvIndex] = mac_cotrl.rxdes_cur->rxdes0 & RXDES0_RFL;/* 读取长度，检查包长度是否超过TX_BUF_SIZE */
        if( RxCtrl.RxBufLen[RxCtrl.RecvIndex] > TX_BUF_SIZE){
#if  CH561_DEBUG
            printf("ERROR *** len large\n");
#endif
            return;
        }
    }
    else{                                                                       /* 不是第一包数据 */
#if  CH561_DEBUG
        printf("ERROR *** not the first package\n");
#endif
        return;
    }
    while(1){
        while(mac_cotrl.rxdes_cur->rxdes0 & RXDES0_RXDMA_OWN);                  /* 等待描述符权限 */
        if(mac_cotrl.rxdes_cur->rxdes0 & RXDES0_LRS){
            MAC_RxSuccessHandle();                                              /* 接收成功处理函数，主要更新控制列表 */
            break;
        }
        mac_cotrl.rxdes_cur->rxdes0 = RXDES0_RXDMA_OWN;                         /* 释放DMA，用于多个描述符，否则在CH561MAC_RxSuccessHandle已经跳转 */
        mac_cotrl.rxdes_cur = (mac_rxdes *)mac_cotrl.rxdes_cur->rxdes3;         /* 将当前描述符指向下一个 */
    }
}

