SoCXin/AT32F413/src/NET/NET_MAC/NET_MAC.C
/*******************************************************************************
* Function Name  : MAC_Input
* Description    : 读取接收数据，读取一帧数据
* Input          : buf  缓冲区,缓冲区的大小必须不小于RX_BUF_SIZE。
*                : len  数据包有效长度
* Output         : None
* Return         : 返回剩余数据包个数，0表示没有数据
*******************************************************************************/
UINT16 MAC_Input(UINT8 *buf,UINT16 *len)
{
    UINT8  *macdata;
    UINT16 mac_len;

    mac_len = RxCtrl.RxBufLen[RxCtrl.ReadIndex];                                /* 获取当前数据包长度 */
    if( mac_len < ETHER_HEAD_LEN ){
        *len = 0;
        return FALSE;
    }
    if(  mac_len > RECE_BUF_LEN ){
        mac_len = RECE_BUF_LEN;
    }
    macdata = (UINT8 *)RxCtrl.RxBufAddr[RxCtrl.ReadIndex];                      /* 获取当前数据包指针 */
    memcpy(ETH.buffer,macdata,ETHER_HEAD_LEN);                                  /* 将以太网包头复制出来 */
    /// 此处可以对mac地址数据长度作检测 /////////
    mac_len -= ETHER_HEAD_LEN;
    memcpy(buf,&macdata[ETHER_HEAD_LEN],mac_len);                               /* 将数据包复制到用户指定的缓冲区中 */
    R8_INT_EN_IRQ_GLOB &= ~RB_IE_IRQ_GLOB;                                      /* 关闭中断，修改接收信息列表 */
    RxCtrl.RxBufStau[RxCtrl.ReadIndex] = BUF_IDLE;                              /* 将当前列表置为空闲状态 */
    RxCtrl.ReadIndex++;                                                         /* 将索引+1 */
    if(RxCtrl.ReadIndex >= RX_QUEUE_NUM){                                       /* 检查索引范围 */
        RxCtrl.ReadIndex = 0;
    }
    if(RxCtrl.RemainCout){                                                      /* 剩余包个数-1 */
        RxCtrl.RemainCout--; 
    }
    R8_INT_EN_IRQ_GLOB |= RB_IE_IRQ_GLOB;                                       /* 开启中断  */
    *len = mac_len;
    return TRUE;
}

/*******************************************************************************
* Function Name  : MAC_Output
* Description    : CH561MAC 发送数据
* Input          : buf  缓冲区,缓冲区的大小必须不得大于TX_BUF_SIZE，且不得小于60
*                : len  数据包有效长度
*                ：code mac层协议类型
* Output         : None
* Return         : 返回发送状态
*******************************************************************************/
UINT8 MAC_Output(UINT8 *buf,UINT16 *len,UINT16 code)
{
    UINT8   timecount = 0;
    UINT16  mac_len;
    
    if(buf) MACSendbuf = buf;
    mac_len = *len;
    if( mac_len > MAC_MAX_LEN ){                                                /* 检查长度，长度大于TX_BUF_SIZE，可能会导致系统错误 */
        mac_len = MAC_MAX_LEN; 
        *len = MAC_MAX_LEN;
    }
    memcpy( ETH.Head.SourMAC,CH561MACAddr,MACADDR_LEN );                        /* 填写本机mac地址 */
    ETH.Head.PROTOCOL = code;                                                   /* 填写协议类型 */
    memcpy( MACTxBuf[TxCtrl.SendIndex],ETH.buffer,ETHER_HEAD_LEN );             /* 将以太网包头复制到发送缓冲区 */
    mac_len += ETHER_HEAD_LEN; 
    if( mac_len < 60){
        memset(&MACTxBuf[mac_len],0,60 - mac_len);                              /* 将不足60的字节的部分补0 */
        mac_len = 60;                                                           /* 最小包为60字节 */
    }
    MAC_Xmit( mac_len);                                                         /* 为了节省RAM，可以直接用buf将数据发送，节省去复制时间，提高效率*/
    while(SendSuc){                                                             /* 发送完毕后，会产生发送成功中断CH561MAC_INT_XPKT_OK */
       timecount++;
       Delay_us(10);
       if((timecount > 200))return FALSE;                                       /* 最大超时时间约为2MS，超时返回FALSE(0) */
    }
    return TRUE;                                                                /* 成功返回TRUE(1) */
}

/*******************************************************************************
* Function Name  : GLOB_nTohs
* Description    : 16位大小端切换
* Input          : in 
* Output         : None
* Return         : None
*******************************************************************************/
UINT16 GLOB_nTohs( UINT16 in ) 
{
    UINT16 out;
    out = (in<<8) | (in>>8);
    return out;
}

/*******************************************************************************
* Function Name  : MAC_Isr
* Description    : MAC中断服务函数
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void MAC_Isr(void)
{
    UINT32  int_status;
     
    int_status = R32_ETHE_ISR;
    if(int_status & RB_RPKT_FINISH) {                                           /* 接收完成中断 */  
        MAC_RecvFinishHanld( );                                     
    }
    if(int_status & RB_XPKT_FINISH){                                            /* 发送完成(TXDMA 将数据写入FIFO，不表示发送成功)*/

    }
    if(int_status & RB_XPKT_OK){                                                /* 数据发送成功 */
        MAC_SendOkHanld( );
    }      
    if(int_status & RB_PHYSTS_CHG){                                             /* PHY改变中断 */
        PHYStatus = PHY_GetLinkStatus( );                                       /* 获取PHY状态 */
#if  CH561_DEBUG
        printf("PHY change,status=%x\r\n",(UINT16)PHYStatus);
#endif
    }                                                                 
}

/*******************************************************************************
* Function Name  : ARP_Output
* Description    : 发送arp请求
* Input          : DestIP，发送的目的ip地址
* Output         : None
* Return         : None
*******************************************************************************/
UINT8 ARP_Output( UINT8 *desip,UINT8 code )
{
    UINT16 arp_len;    

    arp_len = ARP_PACKAGE_LEN;                                               
    ARP.Package.HRDTYPE = GLOB_nTohs( ARP_HARDWARE_TYPE_ETHER );
    ARP.Package.PROTYPE = GLOB_nTohs( ARP_PROTOCOL_TYPE_IP );    
    ARP.Package.MACLEN  = MACADDR_LEN;    
    ARP.Package.IPLEN   = IPADDR_LEN;    
    ARP.Package.OPCODE  = GLOB_nTohs( code );                                   /* 数据包类型，（1 -arp请求，2-arp应答）*/
    memcpy(ARP.Package.TARGIP,desip,IPADDR_LEN);                                /* arp请求的目的ip地址 */
    memset(ARP.Package.TARGMAC,0,MACADDR_LEN);                                  /* arp请求的目的mac地址，为全0 */
    memcpy(ARP.Package.SENDIP,CH561IPAddr,IPADDR_LEN);                          /* 本机ip地址 */
    memcpy(ARP.Package.SENDMAC,CH561MACAddr,MACADDR_LEN);                       /* 本机mac地址 */
    memcpy( MACSendbuf,ARP.buffer,arp_len );                                    /* 将arp数据包复制到发送缓冲区 */
    if( code == ARP_CODE_REPLY ){
        memcpy(ETH.Head.DestMAC,ETH.Head.SourMAC,MACADDR_LEN);                  /* 填写目的mac地址 */
    }
    else memset(ETH.Head.DestMAC,0xff,MACADDR_LEN);                             /* 填写目的mac地址 */
    return ( MAC_Output( MACSendbuf,&arp_len,GLOB_nTohs( ETHER_TYPE_ARP ) ));
}

/*******************************************************************************
* Function Name  : ARP_Input
* Description    : 收到arp包
* Input          : DestIP，发送的目的ip地址
* Output         : None
* Return         : None
*******************************************************************************/
void ARP_Input( UINT8 *arpdata,UINT16 len )
{
    
    if( len < ARP_PACKAGE_LEN ) return;
    memcpy(ARP.buffer,arpdata,ARP_PACKAGE_LEN);
    if(    ARP.Package.HRDTYPE == GLOB_nTohs( ARP_HARDWARE_TYPE_ETHER ) &&
        ARP.Package.PROTYPE == GLOB_nTohs( ARP_PROTOCOL_TYPE_IP ) &&
        ARP.Package.MACLEN  == MACADDR_LEN &&    
        ARP.Package.IPLEN   == IPADDR_LEN ){
        if( ARP.Package.OPCODE  == GLOB_nTohs( ARP_CODE_QUEST )){
            if(  memcmp(ARP.Package.TARGIP,CH561IPAddr,IPADDR_LEN) == 0 ){
                ARP_Output( ARP.Package.TARGIP,ARP_CODE_REPLY );
            }
        }
        else{
            return ;
        }
    }    
}

/*********************************** endfile **********************************/
